In [3]:
import pandas as pd
df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [5]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)

In [6]:
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [7]:
target = df.Survived
inputs=df.drop('Survived',axis='columns')

In [9]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [11]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head()

   Pclass     Sex   Age     Fare  female  male  female  male
0       3    male  22.0   7.2500       0     1       0     1
1       1  female  38.0  71.2833       1     0       1     0
2       3  female  26.0   7.9250       1     0       1     0
3       1  female  35.0  53.1000       1     0       1     0
4       3    male  35.0   8.0500       0     1       0     1

In [12]:
inputs.drop(['Sex','male'],axis='columns',inplace=True)
inputs.head()

   Pclass   Age     Fare  female  female
0       3  22.0   7.2500       0       0
1       1  38.0  71.2833       1       1
2       3  26.0   7.9250       1       1
3       1  35.0  53.1000       1       1
4       3  35.0   8.0500       0       0

In [13]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [14]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [16]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(10)

   Pclass        Age     Fare  female  female
0       3  22.000000   7.2500       0       0
1       1  38.000000  71.2833       1       1
2       3  26.000000   7.9250       1       1
3       1  35.000000  53.1000       1       1
4       3  35.000000   8.0500       0       0
5       3  29.699118   8.4583       0       0
6       1  54.000000  51.8625       0       0
7       3   2.000000  21.0750       0       0
8       3  27.000000  11.1333       1       1
9       2  14.000000  30.0708       1       1

In [22]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.2)

In [23]:
len(X_train)

712

In [24]:
len(X_test)

179

In [25]:
len(inputs)

891

In [21]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [26]:
model.fit(X_train,y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [27]:
model.score(X_test,y_test)

0.7821229050279329

In [28]:
X_test[:10]

     Pclass    Age     Fare  female  female
81        3  29.00   9.5000       0       0
542       3  11.00  31.2750       1       1
453       1  49.00  89.1042       0       0
456       1  65.00  26.5500       0       0
644       3   0.75  19.2583       1       1
224       1  38.00  90.0000       0       0
226       2  19.00  10.5000       0       0
806       1  39.00   0.0000       0       0
293       3  24.00   8.8500       1       1
800       2  34.00  13.0000       0       0

In [29]:
y_test[0:10]

81     1
542    0
453    1
456    0
644    1
224    1
226    1
806    0
293    0
800    0
Name: Survived, dtype: int64

In [30]:
model.predict(X_test[0:10])

array([0, 1, 0, 0, 1, 0, 0, 0, 1, 0], dtype=int64)

In [31]:
model.predict_proba(X_test[:10])

array([[0.98994337, 0.01005663],
       [0.0346711 , 0.9653289 ],
       [0.55793499, 0.44206501],
       [0.847004  , 0.152996  ],
       [0.02558051, 0.97441949],
       [0.57712179, 0.42287821],
       [0.9735479 , 0.0264521 ],
       [0.91138253, 0.08861747],
       [0.0527643 , 0.9472357 ],
       [0.9779075 , 0.0220925 ]])

In [32]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),X_train, y_train, cv=5)

array([0.73426573, 0.76923077, 0.8028169 , 0.76760563, 0.83098592])